codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
void handleDerechaButtonPedal(PedalElement *bt, GUITouchState *touch)
{
		if (touch->touchDetected)
		{
				// touch detected...
				uint16_t x = touch->touchX[0];
				uint16_t y = touch->touchY[0];
				if (x >= bt->botones->flecha_derecha->x && x < bt->botones->flecha_derecha->x + bt->botones->flecha_derecha->width &&
					y >= bt->botones->flecha_derecha->y && y < bt->botones->flecha_derecha->y + bt->botones->flecha_derecha->height)
				{
						bt->botones->flecha_derecha->callback(bt);
				}
		}
}

void handleIzquierdaButtonPedal(PedalElement *bt, GUITouchState *touch)
{
		if (touch->touchDetected)
		{
				// touch detected...
				uint16_t x = touch->touchX[0];
				uint16_t y = touch->touchY[0];
				if (x >= bt->botones->flecha_izquierda->x && x < bt->botones->flecha_izquierda->x + bt->botones->flecha_izquierda->width &&
					y >= bt->botones->flecha_izquierda->y && y < bt->botones->flecha_izquierda->y + bt->botones->flecha_izquierda->height)
				{
						bt->botones->flecha_izquierda->callback(bt);
				}
		}
}

void handleHomeButtonPedal(PedalElement *bt, GUITouchState *touch)
{
		if (touch->touchDetected)
		{
				// touch detected...
				uint16_t x = touch->touchX[0];
				uint16_t y = touch->touchY[0];
				if (x >= bt->botones->home->x && x < bt->botones->home->x + bt->botones->home->width &&
					y >= bt->botones->home->y && y < bt->botones->home->y + bt->botones->home->height)
				{
						bt->botones->home->callback(bt);
				}
		}
}

//Menu Link Izq y Der
void handleDerechaButtonMenu(LinkElementMenu *bt, GUITouchState *touch)
{
		if (touch->touchDetected)
		{
				// touch detected...
				uint16_t x = touch->touchX[0];
				uint16_t y = touch->touchY[0];
				if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height)
				{
							bt->callback(bt);
				}
		}
}

void handleIzquierdaButtonMenu(LinkElementMenu *bt, GUITouchState *touch)
{
		if (touch->touchDetected)
		{
				// touch detected...
				uint16_t x = touch->touchX[0];
				uint16_t y = touch->touchY[0];
				if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height)
				{
						bt->callback(bt);
				}
		}
}

//Callbacks
void LinkCallback(PedalElement *e)
{
		switch(e->link->nombre)
		{
				case DELAY:
						DrawScreen(DELAY);
						pedal_individual=1;
						seleccion_pedal=DELAY;
				break;
				case OCTAVADOR:
						DrawScreen(OCTAVADOR);
						pedal_individual=1;
						seleccion_pedal=OCTAVADOR;
				break;
				case CHORUS:
						DrawScreen(CHORUS);
						pedal_individual=1;
						seleccion_pedal=CHORUS;
				break;
				case PHASER:
						DrawScreen(PHASER);
						seleccion_pedal=PHASER;
						pedal_individual=1;
				break;
				case WAH:
						DrawScreen(WAH);
						pedal_individual=1;
						seleccion_pedal=WAH;
				break;
				case REVERB:
						DrawScreen(REVERB);
						pedal_individual=1;
						seleccion_pedal=REVERB;
				break;
				case DISTORSION:
						DrawScreen(DISTORSION);
						pedal_individual=1;
						seleccion_pedal=DISTORSION;
				break;
				case FLANGER:
						DrawScreen(FLANGER);
						pedal_individual=1;
						seleccion_pedal=FLANGER;
				break;
				case TREMOLO:
						DrawScreen(TREMOLO);
						pedal_individual=1;
						seleccion_pedal=TREMOLO;
				break;
				case VIBRATO:
						DrawScreen(VIBRATO);
						seleccion_pedal=VIBRATO;
						pedal_individual=1;
				break;
				case EQ:
						DrawScreen(EQ);
						pedal_individual=1;
						seleccion_pedal=EQ;
				break;
				case RINGMOD:
						DrawScreen(RINGMOD);
						pedal_individual=1;
						seleccion_pedal=RINGMOD;
				break;
		}
		PedalForceRedraw(e);
}

void PushCallback(PedalElement *e)
{
		if (e->push->push_state & GUI_DIRTY)
		{
				uint8_t states = e->push->push_state & GUI_ONOFF_MASK;
			
				if (pedal_individual==0)
				{
						if(states == GUI_ON)
						{
								switch(e->push->push_menu->nombre)
								{
										case DELAY:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidodelaymenu, 100);	
												drawBitmapRaw(85,96,5,5, buffer_imagenes, CM_ARGB8888, 1);
										break;
										case OCTAVADOR:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidooctavadormenu, 144);
												drawBitmapRaw(237,78,6,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case CHORUS:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidochorusmenu, 36);
												drawBitmapRaw(375,18,3,3, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case PHASER:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidophasermenu, 120);
												drawBitmapRaw(103,210,5,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case WAH:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidowahmenu, 224);
												drawBitmapRaw(236,209,8,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case REVERB:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoreverbmenu, 224);
												drawBitmapRaw(375,211,5,5, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case DISTORSION:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidodistorsionmenu, 100);
												drawBitmapRaw(80,95,5,5, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case FLANGER:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoflangermenu, 144);
												drawBitmapRaw(237,65,6,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case TREMOLO:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidotremolomenu, 256);
												drawBitmapRaw(390,22,8,8, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case VIBRATO:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidovibratomenu, 100);
												drawBitmapRaw(80,232,5,5, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case EQ:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoeqmenu, 84);
												drawBitmapRaw(190,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(209,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(228,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(247,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(267,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(286,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case RINGMOD:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoringmodmenu, 144);
												drawBitmapRaw(373,241,6,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
								}
						}
						else
						{
								switch(e->push->push_menu->nombre)
								{
										case DELAY:
													memcpy(buffer_imagenes, (uint8_t*)ledapagadodelaymenu, 100);		
													drawBitmapRaw(85,96,5,5, buffer_imagenes, CM_ARGB8888, 1);
										break;
										case OCTAVADOR:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadooctavadormenu, 144);	
												drawBitmapRaw(237,78,6,6, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case CHORUS:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadochorusmenu, 36);
												drawBitmapRaw(375,18,3,3, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case PHASER:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadophasermenu, 120);
												drawBitmapRaw(103,210,5,6, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case WAH:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadowahmenu, 100);
												drawBitmapRaw(236,209,8,7, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case REVERB:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadoreverbmenu, 100);
												drawBitmapRaw(375,211,5,5, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case DISTORSION:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadodistorsionmenu, 100);
												drawBitmapRaw(80,95,5,5, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case FLANGER:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadoflangermenu, 144);
												drawBitmapRaw(237,65,6,6, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
										break;
										case TREMOLO:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadotremolomenu, 256);
												drawBitmapRaw(390,22,8,8, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case VIBRATO:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadovibratomenu, 100);
												drawBitmapRaw(80,232,5,5, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case EQ:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadoeqmenu, 84);
												drawBitmapRaw(190,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(209,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(228,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(247,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(267,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
												drawBitmapRaw(286,190,3,7, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case RINGMOD:
												memcpy(buffer_imagenes, (uint8_t*)ledapagadoringmodmenu, 144);
												drawBitmapRaw(373,241,6,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
								}
						}
				}
				else
				{
						if(states == GUI_ON)
						{
								switch(e->push->push_indiv->nombre)
								{
										case DELAY:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidodelaypedal, 360);
												drawBitmapRaw(196,200,10,9, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case OCTAVADOR:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidooctavadorpedal, 960);
												drawBitmapRaw(233,159,15,16, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case CHORUS:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidochoruspedal, 168);
												drawBitmapRaw(236,23,7,6, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case PHASER:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidophaserpedal, 576);
												drawBitmapRaw(235,150,12,12, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case WAH:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidowahpedal, 1368);
												drawBitmapRaw(230,148,19,18, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case REVERB:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoreverbpedal, 676);
												drawBitmapRaw(236,151,13,13, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case DISTORSION:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidodistorsionpedal, 324);
												drawBitmapRaw(198,198,9,9, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case FLANGER:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoflangerpedal, 676);
												drawBitmapRaw(234,130,13,13, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case TREMOLO:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidotremolopedal, 2208);
												drawBitmapRaw(228,29,23,24, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case VIBRATO:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidovibratopedal, 440);
												drawBitmapRaw(196,200,11,10, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
										case EQ:
												PedalForceRedraw(e);
										break;
										case RINGMOD:
												memcpy(buffer_imagenes, (uint8_t*)ledprendidoringmodpedal, 400);
												drawBitmapRaw(195,222,10,10, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
										break;
								}
						}
						else
						{
								switch(e->push->push_indiv->nombre)
								{
								case DELAY:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadodelaypedal, 360);
									drawBitmapRaw(196,200,10,9, (uint8_t*)buffer_imagenes, CM_ARGB8888, 1);
									break;
								case OCTAVADOR:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadooctavadorpedal, 960);
									drawBitmapRaw(233,159,15,16, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case CHORUS:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadochoruspedal, 168);
									drawBitmapRaw(236,23,7,6, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case PHASER:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadophaserpedal, 576);
									drawBitmapRaw(235,150,12,12, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case WAH:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadowahpedal, 1368);
									drawBitmapRaw(230,148,19,18, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case REVERB:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadoreverbpedal, 676);
									drawBitmapRaw(236,151,13,13, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case DISTORSION:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadodistorsionpedal, 324);
									drawBitmapRaw(198,198,9,9, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case FLANGER:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadoflangerpedal, 676);
									drawBitmapRaw(234,130,13,13, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case TREMOLO:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadotremolopedal, 2208);
									drawBitmapRaw(228,29,23,24, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case VIBRATO:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadovibratopedal, 440);
									drawBitmapRaw(196,200,11,10, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								case EQ:
									PedalForceRedraw(e);
									break;
								case RINGMOD:
									memcpy(buffer_imagenes, (uint8_t*)ledapagadoringmodpedal, 400);
									drawBitmapRaw(195,222,10,10, (uint8_t*)buffer_imagenes,CM_ARGB8888, 1);
									break;
								}
						}
				}
		e->push->push_state &= ~((uint16_t) GUI_DIRTY);
		}
}

void LinkDerechaCallbackPedal(PedalElement *e)
{
		seleccion_pedal++;
		if(seleccion_pedal>=0 && seleccion_pedal<6)
		{
				seleccion_menu=MENU_1;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
		else if (seleccion_pedal>=6 && seleccion_pedal<12)
		{
				seleccion_menu=MENU_2;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
		else if(seleccion_pedal==12)
		{
				seleccion_menu=MENU_1;
				seleccion_pedal=0;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
}

