codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
void LinkIzquierdaCallbackPedal(PedalElement *e)
{
		seleccion_pedal--;
		if(seleccion_pedal>=0 && seleccion_pedal<6)
		{
				seleccion_menu=MENU_1;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
		else if (seleccion_pedal>=6 && seleccion_pedal<12)
		{
				seleccion_menu=MENU_2;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
		else if(seleccion_pedal==-1)
		{
				seleccion_menu=MENU_2;
				seleccion_pedal=11;
				DrawScreen(seleccion_pedal);
				PedalForceRedraw(Pedales[seleccion_pedal]);
		}
}

void LinkHomeCallbackPedal(PedalElement *e)
{
		if(seleccion_menu==MENU_1)
		{
				pedal_individual=0;
				DrawScreen(MENU_1);
				MenuForceRedraw();
				seleccion_pedal=20;
		}
		else
		{
				pedal_individual=0;
				DrawScreen(MENU_2);
				MenuForceRedraw();
				seleccion_pedal=20;
		}
}

void LinkDerechaCallbackMenu(LinkElementMenu *e)
{
		seleccion_menu=MENU_2;
		DrawScreen(MENU_2);
		MenuForceRedraw();
}

void LinkIzquierdaCallbackMenu(LinkElementMenu *e)
{
		seleccion_menu=MENU_1;
		DrawScreen(MENU_1);
		MenuForceRedraw();
}

#endif

GUI *initGUI(uint8_t num, sFONT *font, uint32_t bgCol, uint32_t textCol) 
{
		GUI *gui = (GUI *) calloc(1, sizeof(GUI));
		gui->items = (GUIElement **) calloc(num, sizeof(GUIElement *));
		gui->numItems = num;
		gui->font = font;
		gui->bgColor = bgCol;
		gui->textColor = textCol;
		return gui;
}

void initPedals() 
{
		#if SCREEN_ENABLE
		//Inicializo las perillas Pantalla1
		//Delay
		Pedales[0]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[0]->perilla = initPerilla(3);
		Pedales[0]->perilla->perillas[0] = guiDialButton(0, "", 174, 36, 0.0f, 0.045f, PERILLA, &perilla5252, delayFeedback);
		Pedales[0]->perilla->perillas[1] = guiDialButton(1, "", 253, 36, 0.400f, 0.045f, PERILLA, &perilla5252, delayTime);
		Pedales[0]->perilla->perillas[2] = guiDialButton(2, "", 220, 82, 0.5f, 0.045f, PERILLA, &perilla4241, delayLevel);
		//Octavador
		Pedales[1]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[1]->perilla = initPerilla(1);
		Pedales[1]->perilla->perillas[0] =guiDialButton(8, "", 0, 0, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);;
		//Chorus
		Pedales[2]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[2]->perilla = initPerilla(2);
		Pedales[2]->perilla->perillas[0] = guiDialButton(0, "", 187, 22, 0.6f, 0.045f, PERILLA, &perilla4241, chorusRate);
		Pedales[2]->perilla->perillas[1] = guiDialButton(1, "", 250, 22, 0.367f, 0.045f, PERILLA, &perilla4241, chorusDepth);
		//Phaser
		Pedales[3]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[3]->perilla = initPerilla(1);
		Pedales[3]->perilla->perillas[0] = guiDialButton(0, "", 214, 27, 0.667f, 0.045f, PERILLA, &perilla5252, phaserRate);
		//Autowah
		Pedales[4]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[4]->perilla = initPerilla(4);
		Pedales[4]->perilla->perillas[0] = guiDialButton(0, "", 119, 41, 0.43f, 0.045f, PERILLA, &perilla4241, autowahDepth);
		Pedales[4]->perilla->perillas[1] = guiDialButton(1, "", 186, 41, 0.33f, 0.045f, PERILLA, &perilla4241, autowahRate);
		Pedales[4]->perilla->perillas[2] = guiDialButton(2, "", 251, 41, 0.6f, 0.045f, PERILLA, &perilla4241, autowahVolume);
		Pedales[4]->perilla->perillas[3] = guiDialButton(3, "", 319, 41, 0.9f, 0.045f, PERILLA, &whaonda, autowahMod);
		//Reverb
		Pedales[5]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[5]->perilla = initPerilla(2);
		Pedales[5]->perilla->perillas[0] = guiDialButton(0, "", 191, 47, 0.5f, 0.045f, PERILLA, &perilla4241, reverbDecay);
		Pedales[5]->perilla->perillas[1] = guiDialButton(1, "", 253, 47, 0.4f, 0.045f, PERILLA, &perilla4241, reverbMix);

		//Inicializo las perillas Pantalla2
		//Distorsion
		Pedales[6]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[6]->perilla = initPerilla(2);
		Pedales[6]->perilla->perillas[0] = guiDialButton(0, "", 179, 26, 0.61f, 0.045f, PERILLA, &perilla5252, distorsionGain);
		Pedales[6]->perilla->perillas[1] = guiDialButton(1, "", 249, 26, 0.5f, 0.045f, PERILLA, &perilla5252, distorsionBlend);
		//Flanger
		Pedales[7]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[7]->perilla = initPerilla(4);
		Pedales[7]->perilla->perillas[0] =guiDialButton(0, "", 116, 55, 0.0f, 0.045f, PERILLA, &perilla5252, flangerManual);
		Pedales[7]->perilla->perillas[1] =guiDialButton(1, "", 182, 55, 0.57f, 0.045f, PERILLA, &perilla5252, flangerDepth);
		Pedales[7]->perilla->perillas[2] =guiDialButton(2, "", 246, 55, 0.2f, 0.045f, PERILLA, &perilla5252, flangerRate);
		Pedales[7]->perilla->perillas[3] =guiDialButton(3, "", 311, 55, 0.81f, 0.045f, PERILLA, &perilla5252, flangerFeedback);
		//Tremolo
		Pedales[8]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[8]->perilla = initPerilla(3);
		Pedales[8]->perilla->perillas[0] = guiDialButton(0, "", 167, 40, 0.67f, 0.045f, PERILLA, &perilla4241, tremoloDepth);
		Pedales[8]->perilla->perillas[1] = guiDialButton(1, "", 220, 66, 0.2f, 0.045f, PERILLA, &tremoloonda, tremoloMod);
		Pedales[8]->perilla->perillas[2] = guiDialButton(2, "", 269, 40, 0.5f, 0.045f, PERILLA, &perilla4241, tremoloRate);
		//Vibrato
		Pedales[9]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[9]->perilla = initPerilla(3);
		Pedales[9]->perilla->perillas[0] = guiDialButton(0, "", 180, 43, 0.6f, 0.045f, PERILLA, &perilla4241, vibratoRate);
		Pedales[9]->perilla->perillas[1] = guiDialButton(1, "", 257, 43, 0.41f, 0.045f, PERILLA, &perilla4241, vibratoDepth);
		Pedales[9]->perilla->perillas[2] = guiDialButton(2, "", 223, 86, 1.0f, 0.045f, PERILLA, &vibratoonda, vibratoMod);
		//EQ
		Pedales[10]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[10]->perilla = initPerilla(6);
		Pedales[10]->perilla->perillas[0] = guiDialButton(0, "", 111, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain0);
		Pedales[10]->perilla->perillas[1] = guiDialButton(1, "", 156, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain1);
		Pedales[10]->perilla->perillas[2] = guiDialButton(2, "", 201, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain2);
		Pedales[10]->perilla->perillas[3] = guiDialButton(3, "", 246, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain3);
		Pedales[10]->perilla->perillas[4] = guiDialButton(4, "", 291, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain4);
		Pedales[10]->perilla->perillas[5] = guiDialButton(5, "", 336, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain5);
		//Ringmod
		Pedales[11]=(PedalElement*)calloc(1, sizeof(PedalElement));
		Pedales[11]->perilla = initPerilla(1);
		Pedales[11]->perilla->perillas[0] = guiDialButton(0, "", 223, 73, 0.179f, 0.045f, PERILLA, &perilla3535, ringmodRate);

