codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
		//Inicializo los Push (3pdt) Pantalla 1
		//PEDALES Menu
		Pedales[0]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[0]->push->push_menu=initPushLink(DELAY,76,13+110/2,58,110/2,PushCallback, handlePushMenuButton);

		Pedales[1]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[1]->push->push_menu=initPushLink(OCTAVADOR,198,13+110/2,84,110/2,PushCallback, handlePushMenuButton);

		Pedales[2]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[2]->push->push_menu=initPushLink(CHORUS,346,13+110/2,61,110/2,PushCallback, handlePushMenuButton);

		Pedales[3]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[3]->push->push_menu=initPushLink(PHASER,73,149+110/2,64,110/2,PushCallback, handlePushMenuButton);

		Pedales[4]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[4]->push->push_menu=initPushLink(WAH,190,160+88/2,100,88/2,PushCallback, handlePushMenuButton);

		Pedales[5]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[5]->push->push_menu=initPushLink(REVERB,343,149+110/2,67,110/2,PushCallback, handlePushMenuButton);

		//Inicializo los Push (3pdt) Pantalla2
		//PEDALES Menu
		Pedales[6]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[6]->push->push_menu=initPushLink(DISTORSION,70,13+110/2,59,110/2,PushCallback, handlePushMenuButton);

		Pedales[7]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[7]->push->push_menu=initPushLink(FLANGER,179,23+90/2,121,90/2,PushCallback, handlePushMenuButton);

		Pedales[8]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[8]->push->push_menu=initPushLink(TREMOLO,354,13+110/2,80,110/2,PushCallback, handlePushMenuButton);

		Pedales[9]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[9]->push->push_menu=initPushLink(VIBRATO,71,149+110/2,57,110/2,PushCallback, handlePushMenuButton);

		Pedales[10]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[10]->push->push_menu=initPushLink(EQ,181,159+90/2,118,90/2,PushCallback, handlePushMenuButton);

		Pedales[11]->push=(PushElement*)calloc(1, sizeof(PushElement));
		Pedales[11]->push->push_menu=initPushLink(RINGMOD,360,149+110/2,68,110/2,PushCallback, handlePushMenuButton);

		//PEDALES Individuales Pantalla1
		Pedales[0]->push->push_indiv=initPushLink(DELAY,225,189,31,33,PushCallback, handlePushIndividualButton);
		Pedales[1]->push->push_indiv=initPushLink(OCTAVADOR,219,180,42,42,PushCallback, handlePushIndividualButton);
		Pedales[2]->push->push_indiv=initPushLink(CHORUS,180,163,117,77,PushCallback, handlePushIndividualButton);
		Pedales[3]->push->push_indiv=initPushLink(PHASER,222,171,37,37,PushCallback, handlePushIndividualButton);
		Pedales[4]->push->push_indiv=initPushLink(WAH,218,213,41,41,PushCallback, handlePushIndividualButton);
		Pedales[5]->push->push_indiv=initPushLink(REVERB,180,163,117,77,PushCallback, handlePushIndividualButton);

		//PEDALES Individuales Pantalla2
		Pedales[6]->push->push_indiv=initPushLink(DISTORSION,223,184,35,35,PushCallback, handlePushIndividualButton);
		Pedales[7]->push->push_indiv=initPushLink(FLANGER,223,168,37,37,PushCallback, handlePushIndividualButton);
		Pedales[8]->push->push_indiv=initPushLink(TREMOLO,222,203,36,36,PushCallback, handlePushIndividualButton);
		Pedales[9]->push->push_indiv=initPushLink(VIBRATO,221,188,37,37,PushCallback, handlePushIndividualButton);
		Pedales[10]->push->push_indiv=initPushLink(EQ,218,186,37,41,PushCallback, handlePushIndividualButton);
		Pedales[11]->push->push_indiv=initPushLink(RINGMOD,223,210,35,34,PushCallback, handlePushIndividualButton);
		//PEDALES estados
		Pedales[0]->push->push_state=GUI_OFF;
		Pedales[1]->push->push_state=GUI_OFF;
		Pedales[2]->push->push_state=GUI_OFF;
		Pedales[3]->push->push_state=GUI_OFF;
		Pedales[4]->push->push_state=GUI_OFF;
		Pedales[5]->push->push_state=GUI_OFF;
		Pedales[6]->push->push_state=GUI_OFF;
		Pedales[7]->push->push_state=GUI_OFF;
		Pedales[8]->push->push_state=GUI_OFF;
		Pedales[9]->push->push_state=GUI_OFF;
		Pedales[10]->push->push_state=GUI_OFF;
		Pedales[11]->push->push_state=GUI_OFF;

		//Inicializo los links de los pedales Pantalla1
		Pedales[0]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[0]->link=initPushLink(DELAY,76,13,58,110/2,LinkCallback, handleLinkButton);

		Pedales[1]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[1]->link=initPushLink(OCTAVADOR,198,13,84,110/2,LinkCallback, handleLinkButton);

		Pedales[2]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[2]->link=initPushLink(CHORUS,346,13,61,110/2,LinkCallback, handleLinkButton);

		Pedales[3]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[3]->link=initPushLink(PHASER,73,149,64,110/2,LinkCallback, handleLinkButton);

		Pedales[4]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[4]->link=initPushLink(WAH,190,160,100,88/2,LinkCallback, handleLinkButton);

		Pedales[5]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
		Pedales[5]->link=initPushLink(REVERB,343,149,67,110/2,LinkCallback, handleLinkButton);

		//Inicializo los links de los pedales Pantalla2
		Pedales[6]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[6]->link=initPushLink(DISTORSION,70,13,59,110/2,LinkCallback, handleLinkButton);

		Pedales[7]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[7]->link=initPushLink(FLANGER,179,23,121,90/2,LinkCallback, handleLinkButton);

		Pedales[8]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[8]->link=initPushLink(TREMOLO,354,13,80,110/2,LinkCallback, handleLinkButton);

		Pedales[9]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[9]->link=initPushLink(VIBRATO,71,149,57,110/2,LinkCallback, handleLinkButton);

		Pedales[10]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[10]->link=initPushLink(EQ,181,159,118,90/2,LinkCallback, handleLinkButton);

		Pedales[11]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
		Pedales[11]->link=initPushLink(RINGMOD,360,149,68,110/2,LinkCallback, handleLinkButton);

		//Inicializo los botones de las pantallas individuales de los pedales PANTALLA1
		Pedales[0]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[0]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[0]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[0]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[1]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[1]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[1]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[1]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[2]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[2]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[2]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[2]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[3]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[3]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[3]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[3]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[4]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[4]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[4]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[4]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[5]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[5]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[5]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[5]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		//Inicializo los botones de las pantallas individuales de los pedales PANTALLA2
		Pedales[6]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[6]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[6]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[6]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[7]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[7]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[7]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[7]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[8]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[8]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[8]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[8]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[9]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[9]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[9]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[9]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[10]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[10]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[10]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[10]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		Pedales[11]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
		Pedales[11]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
		Pedales[11]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
		Pedales[11]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

		//Link Menu Izq y Der
		Flecha_Menu_Izquierda=(LinkElementMenu*)calloc(1,sizeof(LinkElementMenu));
		Flecha_Menu_Izquierda=initPushLinkMenu(IZQUIERDA_MENU,5,101,39,70,LinkIzquierdaCallbackMenu, handleIzquierdaButtonMenu);
		Flecha_Menu_Derecha=(LinkElementMenu*)calloc(1,sizeof(LinkElementMenu));
		Flecha_Menu_Derecha=initPushLinkMenu(DERECHA_MENU,435,101,39,70,LinkDerechaCallbackMenu, handleDerechaButtonMenu);
		#endif

		//Inicializo los pedales con sus funciones PANTALLA1
		Pedales[0]->efecto=delayEfecto;
		Pedales[1]->efecto=octavadorEfecto;
		Pedales[2]->efecto=chorusEfecto;
		Pedales[3]->efecto=phaserEfecto;
		Pedales[4]->efecto=autowahEfecto;
		Pedales[5]->efecto=reverbEfecto;

		//Inicializo los pedales con sus funciones PANTALLA2
		Pedales[6]->efecto=distorsionEfecto;
		Pedales[7]->efecto=flangerEfecto;
		Pedales[8]->efecto=tremoloEfecto;
		Pedales[9]->efecto=vibratoEfecto;
		Pedales[10]->efecto=eqEfecto;
		Pedales[11]->efecto=ringmodEfecto;
}



